"""Разработайте функцию для извлечения информации из HTML-текста (строки Python)
о ссылках на изображения (URL-адресах картинок).
Функция должна находить все ссылки на изображения в форматах JPEG, JPG, PNG или GIF и
возвращать их список.

1. Создайте функцию extract_image_links(html_text), которая принимает HTML-текст и
извлекает ссылки на изображения.
2. Используйте регулярные выражения для поиска URL-адресов картинок
с расширениями .jpg, .jpeg, .png или .gif.
3. Верните список всех найденных ссылок на изображения."""

